app/controllers/subscribers_controller.rb

INSERT INTO "subscribers" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", Tue, 18 Feb 2014 16:34:23 UTC +00:00], ["updated_at", Tue, 18 Feb 2014 16:34:23 UTC +00:00]]
---
  def create
    @subscriber = Subscriber.new(subscriber_params)

    if @subscriber.save